Repository: mr258876/PRISM-Utility
Catalog: PRISM Utility/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# ScanDebug_Runtime_FieldLed3PulseClock
source: LED3 pulse clocks
zh_cn: LED3 脉冲时钟数

# ScanDebug_Runtime_FieldLed4PulseClock
source: LED4 pulse clocks
zh_cn: LED4 脉冲时钟数

# ScanDebug_Runtime_StatusAutofocusStarted
source: Autofocus started...
zh_cn: 自动对焦已开始...

# ScanDebug_Runtime_AutofocusSampling
source: Autofocus: sampling {0} rows, tilt step {1}, Z step {2}.
zh_cn: 自动对焦：正在采样 {0} 行，倾斜步长 {1}，Z 步长 {2}。

# ScanDebug_Runtime_StatusAutofocusCompleted
source: Autofocus completed.
zh_cn: 自动对焦已完成。

# ScanDebug_Runtime_AutofocusCanceled
source: Autofocus: canceled.
zh_cn: 自动对焦：已取消。

# ScanDebug_Runtime_StatusAutofocusCanceled
source: Autofocus canceled.
zh_cn: 自动对焦已取消。

# ScanDebug_Runtime_AutofocusFailed
source: Autofocus: failed - {0}
zh_cn: 自动对焦：失败 - {0}

# ScanDebug_Runtime_StatusAutofocusFailed
source: Autofocus failed: {0}
zh_cn: 自动对焦失败：{0}

# ScanDebug_Runtime_StatusAutofocusWarmUpRestoreFailed
source: Autofocus finished, but warm-up restore failed: {0}
zh_cn: 自动对焦已结束，但恢复预热失败：{0}

# ScanDebug_Runtime_ErrorAutofocusWarmUpOffRequired
source: Autofocus requires warm-up off: {0}
zh_cn: 自动对焦要求预热关闭：{0}

# ScanDebug_Runtime_StatusManualFocusBusy
source: Manual focus is unavailable while another scan or motion action is running.
zh_cn: 另一个扫描或运动动作正在运行，手动对焦不可用。

# ScanDebug_Runtime_StatusManualFocusStarted
source: Manual focus {0}: jogging {1} mm and sampling {2} rows...
zh_cn: 手动对焦 {0}：正在点动 {1} mm 并采样 {2} 行...

# ScanDebug_Runtime_StatusManualFocusStopped
source: Manual focus stopped.
zh_cn: 手动对焦已停止。

# ScanDebug_Runtime_StatusManualFocusCompleted
source: Manual focus completed.
zh_cn: 手动对焦已完成。

# ScanDebug_Runtime_StatusManualFocusFailed
source: Manual focus failed: {0}
zh_cn: 手动对焦失败：{0}

# ScanDebug_Runtime_StatusManualFocusScanFailed
source: Manual focus preview scan failed: {0}
zh_cn: 手动对焦预览扫描失败：{0}

# ScanDebug_Runtime_StatusManualFocusMotionTimeout
source: Manual focus motion did not settle before timeout.
zh_cn: 手动对焦运动未能在超时前稳定。

# ScanDebug_Runtime_ManualFocusPreviewPhase
source: Manual focus {0} {1} mm
zh_cn: 手动对焦 {0} {1} mm

# ScanDebug_Runtime_ErrorManualFocusDistancePositive
source: Manual focus distance must be a finite value greater than 0 mm.
zh_cn: 手动对焦距离必须是大于 0 mm 的有限值。

# ScanDebug_Runtime_ErrorManualFocusDistanceMaximum
source: Manual focus distance must not exceed {0} mm.
zh_cn: 手动对焦距离不得超过 {0} mm。

# ScanDebug_Runtime_ErrorManualFocusStepRange
source: Manual focus distance must resolve to between 1 and {0} steps for each mapped motor.
zh_cn: 手动对焦距离在每个映射电机上必须换算为 1 到 {0} 步。

# ScanDebug_Runtime_ErrorManualFocusDurationMaximum
source: Manual focus estimated one-way travel must not exceed {0} ms.
zh_cn: 手动对焦预计单程运动时间不得超过 {0} ms。

# ScanDebug_Runtime_RowsLimitExceeded.Title
source: Rows limit exceeded
zh_cn: 超出行数限制

# ScanDebug_Runtime_RowsLimitExceeded.Content
source: Rows greater than {0} require both Multi-buffer bulk IN and Raw I/O to be enabled in Settings.
zh_cn: 大于 {0} 的行数要求在“设置”中同时启用 Multi-buffer bulk IN 和 Raw I/O。

# ScanDebug_Runtime_StatusRowsLimitExceeded
source: Rows above {0} require Multi-buffer bulk IN and Raw I/O.
zh_cn: 高于 {0} 的行数需要启用 Multi-buffer bulk IN 和 Raw I/O。

# ScanDebug_Runtime_ErrorRowsWarmUpPositive
source: Rows must be a positive number when warm-up is enabled.
zh_cn: 启用预热时，行数必须是正数。

# ScanDebug_Runtime_ErrorRowsRange
source: Rows must be a number in [1, {0}].
zh_cn: 行数必须是 [1, {0}] 范围内的数字。

# ScanDebug_Runtime_StatusStartingContinuousScan
source: Starting continuous scan...
zh_cn: 正在开始连续扫描...

# ScanDebug_Runtime_StatusStartingScan
source: Starting scan...
zh_cn: 正在开始扫描...

# ScanDebug_Runtime_StatusStartingMultiChannelScan
source: Starting multi-channel scan workflow...
zh_cn: 正在开始多通道扫描流程...

# ScanDebug_Runtime_ErrorWorkflowContinuousUnsupported
source: Workflow scan cannot run while Continuous is enabled. Disable Continuous before starting.
zh_cn: workflow 扫描不能在“连续”启用时运行。请先关闭“连续”。

# ScanDebug_Runtime_ErrorMultiChannelContinuousUnsupported
source: Multi-channel debug scan cannot run while Continuous is enabled. Disable Continuous before starting.
zh_cn: 多通道调试扫描不能在“连续”启用时运行。请先关闭“连续”。

# ScanDebug_Runtime_ErrorMotorTransportContinuousUnsupported
source: Continuous scan cannot run while scan motor transport is enabled. Disable Continuous before starting.
zh_cn: 启用扫描电机传送时不能运行连续扫描。请先关闭“连续”。

# ScanDebug_Runtime_ErrorContinuousRequiresSingleChannel
source: Continuous capture requires exactly one selected acquisition channel. Select one channel or choose Single sample / Transport scan.
zh_cn: 连续采样仅支持单通道。 请选择一个通道，或切换采集模式。

# ScanDebug_Runtime_ErrorNoActiveScanChannels
source: Select at least one active scan channel before starting a workflow scan.
zh_cn: 启动扫描流程前，至少选择一个有效扫描通道。

# ScanDebug_Runtime_StatusAtLeastOneAcquisitionChannelRequired
source: At least one acquisition channel must remain selected.
zh_cn: 至少需要保留一个采集通道。

# ScanDebug_Runtime_ErrorSingleChannelRequiresExactlyOnePass
source: Single-channel scan requires exactly one active scan channel. Set the others to Unused or enable multi-channel scan.
zh_cn: 单通道扫描要求恰好一个有效扫描通道。请将其他通道设为 Unused，或启用多通道扫描。

# ScanDebug_Runtime_StatusMultiChannelProgress
source: Multi-channel pass {0}/{1}: {2} LED{3}.
zh_cn: 多通道第 {0}/{1} 轮：{2} LED{3}。

# ScanDebug_Runtime_StatusMultiChannelScanCompleted
source: Multi-channel scan completed ({0} passes); showing pass {1}.
zh_cn: 多通道扫描完成（{0} 轮）；正在显示第 {1} 轮。

# ScanDebug_Runtime_StatusMultiChannelNoPassData
source: Multi-channel workflow completed without captured pass data.
zh_cn: 多通道流程已完成，但没有采集到轮次数据。

# ScanDebug_Runtime_StatusMultiChannelScanCanceled
source: Multi-channel scan canceled.
zh_cn: 多通道扫描已取消。

# ScanDebug_Runtime_StatusMultiChannelScanFailed
source: Multi-channel scan failed: {0}
zh_cn: 多通道扫描失败：{0}

# ScanDebug_Runtime_StatusStopRequested
source: Stop requested.
zh_cn: 已请求停止。

# ScanDebug_Runtime_StatusContinuousScanNoImageData
source: Continuous scan completed without image data.
zh_cn: 连续扫描已完成，但没有图像数据。

# ScanDebug_Runtime_StatusContinuousPreviewUpdated
source: Continuous preview updated ({0}).
zh_cn: 连续预览已更新（{0}）。

# ScanDebug_Runtime_StatusPreviewSkippedAuto
source: {0} Preview skipped automatically for scans over {1} rows.
zh_cn: 对于超过 {1} 行的扫描，{0} 预览已自动跳过。

# ScanDebug_Runtime_StatusPreviewSkipped
source: {0} Preview skipped.
zh_cn: {0} 预览已跳过。

# ScanDebug_Runtime_StatusWarmUpWillEnableAfterConnect
source: Warm-up will be enabled after the scanner is connected.
zh_cn: 扫描仪连接后将启用预热。

# ScanDebug_Runtime_StatusWarmUpDisabled
source: Warm-up disabled.
zh_cn: 预热已禁用。

# ScanDebug_Runtime_StatusWarmUpEnableCanceled
source: Warm-up enable canceled.
zh_cn: 启用预热已取消。

# ScanDebug_Runtime_StatusWarmUpDisableCanceled
source: Warm-up disable canceled.
zh_cn: 禁用预热已取消。

# ScanDebug_Runtime_StatusAutoCalibrationStarted
source: Auto calibration started...
zh_cn: 自动校准已开始...

# ScanDebug_Runtime_StatusAutoCalibrationCanceled
source: Auto calibration canceled.
zh_cn: 自动校准已取消。

# ScanDebug_Runtime_StatusAutoCalibrationFailed
source: Auto calibration failed: {0}
zh_cn: 自动校准失败：{0}

# ScanDebug_Runtime_PendingCalibrationSelectedChannel
source: Captured selected channel: {0}
zh_cn: 捕获时所选通道：{0}

# ScanDebug_Runtime_PendingCalibrationMetric
source: Before {0} -> after {1}
zh_cn: 之前 {0} -> 之后 {1}

# ScanDebug_Runtime_PendingCalibrationValidationValid
source: Valid
zh_cn: 有效

# ScanDebug_Runtime_PendingCalibrationValidationInvalid
source: Invalid
zh_cn: 无效

# ScanDebug_Runtime_PendingCalibrationValidationWarning
source: Valid with warning(s)
zh_cn: 有效但有警告

# ScanDebug_Runtime_PendingCalibrationValidationIssues
source: Issues: {0}
zh_cn: 问题：{0}

# ScanDebug_Runtime_PendingCalibrationValidationNoIssues
source: No validation issues.
zh_cn: 没有验证问题。

# ScanDebug_Runtime_DispatchFailed
source: Failed to dispatch work to the UI thread.
zh_cn: 无法将工作调度到 UI 线程。

# ScanDebug_Runtime_StatusPhasePreviewUpdated
source: {0}: preview updated.
zh_cn: {0}：预览已更新。

# ScanDebug_Runtime_LimitLabelAdc1Offset
source: ADC1 offset
zh_cn: ADC1 偏移

# ScanDebug_Runtime_LimitLabelAdc2Offset
source: ADC2 offset
zh_cn: ADC2 偏移

# ScanDebug_Runtime_LimitLabelAdc1Gain
source: ADC1 gain
zh_cn: ADC1 增益

# ScanDebug_Runtime_LimitLabelAdc2Gain
source: ADC2 gain
zh_cn: ADC2 增益

# ScanDebug_Runtime_LimitLabelSampleRows
source: Sample rows
zh_cn: 采样行数

# ScanDebug_Runtime_LimitLabelTiltProbeSteps
source: Tilt probe steps
zh_cn: 倾斜探测步数

# ScanDebug_Runtime_LimitLabelZProbeSteps
source: Z probe steps
zh_cn: Z 探测步数

# ScanDebug_Runtime_LimitLabelMotorInterval
source: Motor interval
zh_cn: 电机间隔

# ScanDebug_Runtime_LimitBoundedInvalidInteger
source: {0} limit: {1} ~ {2} | current input is not an integer
zh_cn: {0}：{1} ~ {2}；需为整数

# ScanDebug_Runtime_LimitBoundedCurrentOutOfRange
source: {0} limit: {1} ~ {2} | current: {3} (out of range)
zh_cn: {0}：{1} ~ {2}；{3} 超范围

# ScanDebug_Runtime_LimitLowerBound
source: {0} limit: >= {1}
zh_cn: {0} 限制：>= {1}

# ScanDebug_Runtime_LimitLowerBoundInvalidInteger
source: {0} limit: >= {1} | current input is not an integer
zh_cn: {0} 限制：>= {1} | 当前输入不是整数

# ScanDebug_Runtime_LimitLowerBoundCurrentBelowMinimum
source: {0} limit: >= {1} | current: {2} (below minimum)
zh_cn: {0} 限制：>= {1} | 当前：{2}（低于最小值）

# ScanDebug_Runtime_LimitLowerBoundCurrent
source: {0} limit: >= {1} | current: {2}
zh_cn: {0} 限制：>= {1} | 当前：{2}

# ScanDebug_Runtime_ErrorSteadySyncOverlap
source: Steady and sync selections cannot overlap on the same LED channel.
zh_cn: 同一 LED 通道上的常亮和同步选择不能重叠。

# ScanDebug_Runtime_ErrorMotorSelectionRange
source: Motor selection must be in [1, {0}].
zh_cn: 电机选择必须在 [1, {0}] 范围内。

# ScanDebug_Runtime_ErrorMotorStepsPositive
source: Motor{0} Steps must be a positive integer.
zh_cn: Motor{0} 步⁠数必须是正整数。

# ScanDebug_Runtime_ErrorMotorMoveValuePositive
source: Motor{0} move value must be a valid positive {1} value.
zh_cn: Motor{0} 的移动值必须是有效的正 {1} 数值。

# ScanDebug_Runtime_ErrorMotorMoveDistanceTooSmall
source: Motor{0} move value in {1} resolves to less than one step. Increase the input.
zh_cn: Motor{0} 的移动值按 {1} 换算后不足 1 步，请增大输入。

# ScanDebug_Runtime_ErrorMotorIntervalMinimum
source: Motor{0} Interval must be an integer >= {1} us.
zh_cn: Motor{0} 间隔必须是整数且 >= {1} us。

# ScanDebug_Runtime_ErrorMotorSpeedValuePositive
source: Motor{0} speed value must be a valid positive {1}/s value.
zh_cn: Motor{0} 的速度值必须是有效的正 {1}/s 数值。

# ScanDebug_Runtime_ErrorMotorSpeedTooHigh
source: Motor{0} speed is too high and would resolve below the minimum motor interval of {1} us.
zh_cn: Motor{0} 的速度过高，换算后会低于最小电机间隔 {1} us。

# ScanDebug_Runtime_ErrorAutofocusRowsRange
source: Autofocus rows must be an integer in [1, {0}].
zh_cn: 自动对焦行数必须是 [1, {0}] 范围内的整数。

# ScanDebug_Runtime_ErrorAutofocusTiltPositive
source: Autofocus tilt step must be a positive integer.
zh_cn: 自动对焦倾斜步长必须是正整数。

# ScanDebug_Runtime_ErrorAutofocusZPositive
source: Autofocus Z step must be a positive integer.
zh_cn: 自动对焦 Z 步长必须是正整数。

# ScanDebug_Runtime_ErrorAutofocusIntervalMinimum
source: Autofocus interval must be an integer >= {0} us.
zh_cn: 自动对焦间隔必须是整数且 >= {0} us。

# ScanDebug_Runtime_ErrorAutofocusIterationsPositive
source: Autofocus iteration limits must be positive integers.
zh_cn: 自动对焦迭代限制必须是正整数。

# ScanDebug_Runtime_ErrorAutofocusMappedMechanicsMismatch
source: Mapped focus motors must use identical mechanics before autofocus can run.
zh_cn: 映射的对焦电机必须使用相同机械参数，才能运行自动对焦。

# ScanDebug_Runtime_AutofocusPresetQuick
source: Quick
zh_cn: 快速

# ScanDebug_Runtime_AutofocusPresetStandard
source: Standard
zh_cn: 标准

# ScanDebug_Runtime_AutofocusPresetFine
source: Fine
zh_cn: 精细

# ScanDebug_Runtime_AutofocusPresetCustom
source: Custom
zh_cn: 自定义

# ScanDebug_Runtime_AutofocusBounds
source: Resolved bounds: tilt probe {0} steps, Z probe {1} steps, max tilt {2} steps, max Z {3} steps, {4} captures, {5} mm total movement, about {6}.
zh_cn: 解析边界：倾斜探测 {0} 步，Z 探测 {1} 步，最大倾斜 {2} 步，最大 Z {3} 步，{4} 次采集，总移动 {5} mm，约 {6}。

# ScanDebug_Runtime_AutofocusSummary
source: Autofocus: {0} rows, tilt={1} steps, Z={2} steps, overall={3}, left={4}, right={5}, imbalance={6}.
zh_cn: 自动对焦：{0} 行，倾斜={1} 步，Z={2} 步，整体={3}，左侧={4}，右侧={5}，失衡={6}。

# ScanDebug_Runtime_FocusMappingDefaultStatus
source: Default mapping: left Motor1, right Motor3.
zh_cn: 默认映射：左侧 Motor1，右侧 Motor3。

# ScanDebug_Runtime_FocusMappingReadyStatus
source: Focus mapping is valid. Save to persist it for autofocus and manual focus.
zh_cn: 对焦映射有效。保存后将用于自动对焦和手动对焦。

# ScanDebug_Runtime_FocusMappingSavedStatus
source: Focus mapping saved.
zh_cn: 对焦映射已保存。

# ScanDebug_Runtime_FocusMappingSaveFailed
source: Focus mapping save failed: {0}
zh_cn: 保存对焦映射失败：{0}

# ScanDebug_Runtime_FocusMappingLeftMotorLabel
source: left focus motor
zh_cn: 左侧对焦电机

# ScanDebug_Runtime_FocusMappingRightMotorLabel
source: right focus motor
zh_cn: 右侧对焦电机

# ScanDebug_Runtime_FocusMappingTestMoveStarted
source: Testing {0}: move out and back by {1} mm.
zh_cn: 正在测试{0}：往返移动 {1} mm。

# ScanDebug_Runtime_FocusMappingTestMoveCompleted
source: Focus mapping test completed for {0}.
zh_cn: {0}的对焦映射测试已完成。

# ScanDebug_Runtime_FocusMappingTestMoveCanceled
source: Focus mapping test canceled.
zh_cn: 对焦映射测试已取消。

# ScanDebug_Runtime_FocusMappingTestMoveFailed
source: Focus mapping test failed: {0}
zh_cn: 对焦映射测试失败：{0}

# ScanDebug_Runtime_ErrorFocusMappingTestMoveTooSmall
source: Focus mapping test move resolves to less than one step. Increase motor distance calibration first.
zh_cn: 对焦映射测试移动不足 1 步。请先增大电机距离校准。

# ScanDebug_Runtime_ErrorFocusMappingMotorSelection
source: Select two focus motors in the range Motor1 to Motor{0}.
zh_cn: 请选择 Motor1 到 Motor{0} 范围内的两个对焦电机。

# ScanDebug_Runtime_ErrorFocusMappingLeftMotorRange
source: Left focus motor must be in the range Motor1 to Motor{0}.
zh_cn: 左侧对焦电机必须在 Motor1 到 Motor{0} 范围内。

# ScanDebug_Runtime_ErrorFocusMappingRightMotorRange
source: Right focus motor must be in the range Motor1 to Motor{0}.
zh_cn: 右侧对焦电机必须在 Motor1 到 Motor{0} 范围内。

# ScanDebug_Runtime_ErrorFocusMappingDuplicateMotors
source: Left and right focus motors must be different motors.
zh_cn: 左侧和右侧对焦电机必须不同。

# ScanDebug_Runtime_StatusStopAllFocusLocalCleanup
source: Focus cancellation requested locally. No active focus motors needed a stop command.
zh_cn: 已在本地请求取消对焦。没有活动对焦电机需要停止命令。

# ScanDebug_Runtime_StatusStopAllFocusRequested
source: Stop all focus requested for active focus motors.
zh_cn: 已请求停止全部活动对焦电机。

# ScanDebug_Runtime_StatusStopAllFocusFailed
source: Stop all focus failed: {0}
zh_cn: 停止全部对焦失败：{0}

# ScanDebug_Runtime_MotionStateReadRequired
source: Motion state is unknown. Read device motion state before starting another motion command.
zh_cn: 运动状态未知。启动其他运动命令前请读取设备运动状态。

# ScanDebug_Runtime_MotorRoleLeftFocus
source: left focus motor
zh_cn: 左侧对焦电机

# ScanDebug_Runtime_MotorRoleRightFocus
source: right focus motor
zh_cn: 右侧对焦电机

# ScanDebug_Runtime_MotorRoleScanTransport
source: film transport motor
zh_cn: 胶片传送电机

# ScanDebug_Runtime_MotorRoleNone
source: no configured semantic role
zh_cn: 没有已配置的语义角色

# ScanDebug_Runtime_MotorMoveSummary
source: {0}: {1}; distance {2} mm; estimated steps {3}; estimated duration {4} s; logical direction {5}; raw direction {6}; physical direction unknown.
zh_cn: {0}：{1}；移动距离 {2} mm；预⁠计⁠步⁠数 {3}；预计耗时 {4} s；逻辑方向 {5}；原始方向 {6}；物理方向未知。

# ScanDebug_Runtime_MotorMoveSummaryInvalid
source: {0}: {1}; requested move is invalid: {2}
zh_cn: {0}：{1}；请求移动无效：{2}

# ScanDebug_Runtime_MotorLogicalDirectionUnmapped
source: unmapped
zh_cn: 未映射

# ScanDebug_Runtime_MotorLogicalDirectionFocusZPositive
source: focus Z+
zh_cn: 对焦 Z+

# ScanDebug_Runtime_MotorLogicalDirectionFocusZNegative
source: focus Z-
zh_cn: 对焦 Z-

# ScanDebug_Runtime_MotorLogicalDirectionTransport
source: film transport {0}
zh_cn: 胶片传送 {0}

# ScanDebug_Runtime_MotorApplyConfigEffect
source: Applies the device motor configuration to {0}, then reads motion state. Editor speed, distance, and direction fields are not sent by this command.
zh_cn: 将设备电机配置应用到 {0}，然后读取运动状态。此命令不会发送编辑器中的速度、距离和方向字段。

# ScanDebug_Runtime_StatusStopAllMotorsSucceeded
source: All motor stop commands were dispatched for Motor1, Motor2, and Motor3. Hardware motion state was not verified; read motion state before resuming motion.
zh_cn: 已向 Motor1、Motor2 和 Motor3 派发全部电机停止命令。硬件运动状态尚未验证；恢复运动前请读取运动状态。

# ScanDebug_Runtime_StatusStopAllMotorsFailed
source: Stop all motors failed: {0}
zh_cn: 停止全部电机失败：{0}

# ScanDebug_Runtime_StatusStopAllMotorsPartial
source: Stop all motors completed with failures: {0}. Hardware motion state was not verified; read motion state before resuming motion.
zh_cn: 停止全部电机已完成但存在失败：{0}。硬件运动状态尚未验证；恢复运动前请读取运动状态。

# ScanDebug_Runtime_StatusStopAllMotorsQuarantined
source: Global motor stop outcome is unknown. The command transaction remains quarantined. Unattempted motors: {0}. Hardware motion state was not verified; read motion state before resuming motion.
zh_cn: 全局电机停止结果未知。当前命令事务仍处于隔离状态。未尝试的电机：{0}。硬件运动状态尚未验证；恢复运动前请读取运动状态。

# ScanDebug_Runtime_ErrorNonNegativeInteger
source: {0} must be a non-negative integer.
zh_cn: {0} 必须是非负整数。

# ScanDebug_Runtime_ErrorSyncPulseMinimum
source: {0} must be at least {1} when sync is enabled for that channel.
zh_cn: 当该通道启用同步时，{0} 至少必须为 {1}。

# ScanDebug_Runtime_IlluminationSummary
source: Illumination state: Steady={0}, Sync={1}, Active={2}
zh_cn: 照明状态：Steady={0}, Sync={1}, Active={2}

# ScanDebug_Runtime_MotorStatusUnavailable
source: State: unavailable
zh_cn: 状态：不可用

# ScanDebug_Runtime_MotorStatus
source: State: Enabled={0}, Running={1}, Direction={2}, DIAG={3}, Interval={4} us, Remaining={5}
zh_cn: 状态：Enabled={0}, Running={1}, Direction={2}, DIAG={3}, Interval={4} us, Remaining={5}

# ScanDebug_Runtime_DiagHigh
source: High
zh_cn: 高

# ScanDebug_Runtime_DiagLow
source: Low
zh_cn: 低

# ScanDebug_Runtime_MotionSummaryItemUnavailable
source: Motor{0}=unavailable
zh_cn: Motor{0}=不可用

# ScanDebug_Runtime_MotionSummary
source: Motion state: {0}
zh_cn: 运动状态：{0}

# ScanDebug_Runtime_MotionStateRunning
source: running
zh_cn: 运行中

# ScanDebug_Runtime_MotionStateEnabled
source: enabled
zh_cn: 已启用

# ScanDebug_Runtime_MotionStateDisabled
source: disabled
zh_cn: 已禁用

# ScanDebug_Runtime_Yes
source: Yes
zh_cn: 是

# ScanDebug_Runtime_No
source: No
zh_cn: 否

# ScanDebug_Runtime_None
source: none
zh_cn: 无

# ScanDebug_Runtime_CursorPosition
source: Cursor: ({0}, {1}) px
zh_cn: 光标：({0}, {1}) px

# ScanDebug_Runtime_CursorPositionDefault
source: Cursor: (-, -) px
zh_cn: 光标：(-, -) px

# Scan_AdvancedRecipeOverridesSection.Text
source: Advanced recipe overrides
zh_cn: 高级配方覆盖

# Scan_AdvancedColorManagementSection.Text
source: Current configuration color management
zh_cn: 当前配置色彩管理

# ScanDebug_ProfileRecipeTitle.Text
source: Scan recipe authored by this profile
zh_cn: 此配置编写的扫描配方

# ScanDebug_ProfileRecipeHelpText.Text
source: These settings are saved with the exported film profile and become the loaded scan recipe on the Scan page.
zh_cn: 这些设置会随导出的胶片配置保存，并在扫描页面作为已加载的扫描配方应用。

# Scan_Runtime_RecipeSummary
source: Recipe: {0}. Row-reversed channels: {1}. Alignment: {2}. DNG: {3}. Color: {4}.
zh_cn: 配方：{0}。行方向反转通道：{1}。对齐：{2}。DNG：{3}。色彩：{4}。

# Scan_Runtime_RecipeSummaryColorManaged
source: spectral sRGB ({0}/{1}/{2} nm, gamma {3})
zh_cn: 光谱 sRGB（{0}/{1}/{2} nm，伽马 {3}）

# Scan_Runtime_RecipeSummaryGammaOnly
source: gamma-only sRGB (gamma {0})
zh_cn: 仅伽马 sRGB（伽马 {0}）

# Settings_ColorManagementScopeText.Text
source: Global defaults only. Change per-scan color behavior in the loaded scan configuration.
zh_cn: 仅全局默认值。单次扫描的色彩行为请在已加载扫描配置中修改。

# Scan_PageRoleDescription.Text
source: Formal scan workspace: load a configuration, review the effective recipe, run the scan, then save RGB or export DNG output.
zh_cn: 正式扫描工作区：加载配置、确认当前生效配方、执行扫描，然后保存 RGB 或导出 DNG。

# Scan_DeviceCardTitle.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: When this page is connected or scanning, it owns the USB device. Disconnect here before using USB Debug on the same hardware.
zh_cn: 此页面连接或扫描时会占用 USB 设备。若要在同一硬件上使用 USB 调试，请先在此断开连接。

# Scan_ConfigCardTitle.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: These controls define the formal scan run. The loaded configuration is the source of truth for recipe, color, and DNG mode; global settings only provide defaults for new or reset configurations.
zh_cn: 这些控件定义正式扫描流程。已加载配置是配方、色彩和 DNG 模式的来源；全局设置只为新建或重置配置提供默认值。

# Scan_ColorSourceText.Text
source: Effective source: loaded scan configuration. If no configuration is loaded, the current values were initialized from global defaults.
zh_cn: 生效来源：已加载扫描配置。若未加载配置，当前值来自全局默认值初始化。

source: Output actions use the current scan result and the loaded configuration DNG mode. DNG mode is saved with the scan configuration, not the global settings.
zh_cn: 输出操作使用当前扫描结果和已加载配置中的 DNG 模式。DNG 模式随扫描配置保存，不属于全局设置。

source: DNG geometry defaults describe exported metadata and active/masked columns; preview ROI tools in Scan Debug are separate unless their selected ROI target is explicitly applied there.
zh_cn: DNG 几何默认值描述导出元数据中的有效列和 masked 列；扫描调试中的预览 ROI 工具与其分离，除非在那里明确应用所选 ROI 目标。

source: Selects the DNG mode for debug exports from the latest Scan Debug acquisition only. It does not change the authored scan configuration.
zh_cn: 只选择最近一次扫描调试采集结果的 DNG 导出模式，不会修改所编写的扫描配置。

# ScanDebug_PageRoleDescription.Text
source: Film Profile and Calibration workbench: author profile JSON, calibrate channels, preview temporary acquisitions, and release the scanner before USB Debug or formal Scan uses the same hardware.
zh_cn: 胶片配置与校准工作台：编写配置 JSON、校准通道、预览临时采集；若要让 USB 调试或正式扫描使用同一硬件，请先释放扫描仪。

# ScanDebug_WorkstationTitle.Text
source: Film Profile and Calibration
zh_cn: 胶片配置与校准

source: Film Profile and Calibration workbench: author profile JSON, calibrate channels, preview temporary acquisitions, and release the scanner before USB Debug or formal Scan uses the same hardware.
zh_cn: 胶片配置与校准工作台：编写配置 JSON、校准通道、预览临时采集；若要让 USB 调试或正式扫描使用同一硬件，请先释放扫描仪。

# ScanDebug_DeviceStatusLabel.Text
source: Status
zh_cn: 状态

# ScanDebug_WorkstationDetailsButton.Content
source: Details
zh_cn: 详情

source: Film Profile and Calibration details
zh_cn: 胶片配置与校准详情

# ScanDebug_UsbConflictGuidance.Text
source: A connected debug session owns the USB device. Disconnect here before opening USB Debug or starting a formal scan on the same hardware.
zh_cn: 已连接的调试会话会占用 USB 设备。若要打开 USB 调试或在同一硬件上执行正式扫描，请先在此断开连接。

# ScanDebug_BasicAcquisitionTitle.Text
source: Basic debug acquisition parameters
zh_cn: 基础调试采集参数

# ScanDebug_BasicAcquisitionScopeText.Text
source: Temporary acquisition overrides for this debug session. Use the Scan page for formal scan runs.
zh_cn: 仅本次调试会话的临时采集覆盖参数。正式扫描请使用扫描页。

# ScanDebug_AcquisitionChannelsTitle.Text
source: Acquisition channels
zh_cn: 采集通道

# ScanDebug_AcquisitionChannelsHelpText.Text
source: Select one channel for single-channel debug capture, or select multiple channels for a workflow capture. At least one channel must stay selected.
zh_cn: 选择一个通道进行单通道调试采集，选择多个通道则执行 workflow 采集。至少需要保留一个通道。

# ScanDebug_AdvancedDebugSwitchesTitle.Text
source: Advanced debug switches
zh_cn: 高级调试开关

# ScanDebug_AdvancedDebugSwitchesScopeText.Text
source: Experimental flow controls for hardware validation only. They are not required for ordinary formal scans.
zh_cn: 用于硬件验证的实验流程控制，普通正式扫描不需要启用。

# ScanDebug_OutputTitle.Text
source: Output
zh_cn: 输出

# ScanDebug_OutputScopeText.Text
source: Export DNG uses the latest debug acquisition and the DNG mode selected in the page header. The authored configuration DNG mode is edited in configuration load/save.
zh_cn: 导出 DNG 使用最近一次调试采集结果，以及页面标题栏中选择的 DNG 模式。配置中的 DNG 模式在配置加载/保存处修改。

# ScanDebug_ProfileConfigScopeText.Text
source: Alignment, DNG export mode, and color management here are configuration-scoped profile values, not global defaults.
zh_cn: 此处的对齐模式、DNG 导出模式和色彩管理是配置文件范围内的值，不是全局默认值。

# ScanDebug_CalibrationTitle.Text
source: Calibration column samples
zh_cn: 校准列采样
